### The notebook shows how to save data into local SQL database and read it from the database

In [1]:
import datetime
from UTCDAL.Utilities import login
from UTCDAL.Utilities.DataAccess import sql_class
from UTCDAL.Utilities.DataAccess import simple_wc as webctrl

#### Firstly make some data:

In [2]:
WEBCTRLSERVER = "172.31.3.16"
WEBCTRLUSER, WEBCTRLPASS = login()

In [3]:
df = webctrl.get_trend('#utrc_l_meter_12/real_pwr_tn', datetime.datetime(2018,5,1).strftime('%Y-%m-%d'), \
                       '3', url=WEBCTRLSERVER, username=WEBCTRLUSER, password=WEBCTRLPASS)

Using cached xmlsoap schemas
Request sent. Waiting for WebCTRL response...
Received 4320 data points.

In [4]:
df.head()

                     #utrc_l_meter_12/real_pwr_tn
2018-05-01 00:00:00                      0.001010
2018-05-01 00:01:00                      0.000993
2018-05-01 00:02:00                      0.000969
2018-05-01 00:03:00                      0.001107
2018-05-01 00:04:00                      0.000984

In [5]:
df.columns = ['value']
df['time'] = df.index
df = df.reset_index()[['time','value']]
df.head()

                 time     value
0 2018-05-01 00:00:00  0.001010
1 2018-05-01 00:01:00  0.000993
2 2018-05-01 00:02:00  0.000969
3 2018-05-01 00:03:00  0.001107
4 2018-05-01 00:04:00  0.000984

#### Connect to SQL database:

In [6]:
sql = sql_class.Sql(host='172.28.203.127:3306', schema='dal_test')

MySQL user name: chao
MySQL password: ········

#### Write the 'df' into database:

In [ ]:
sql.write_mysql(df, tablename='technical_wiki', mode='replace', store_index=False)

#### Read the data just saved from the database

Option1:

In [8]:
read_data1 = sql.read_mysql('technical_wiki')
read_data1.head()

                 time     value
0 2018-05-01 00:00:00  0.001010
1 2018-05-01 00:01:00  0.000993
2 2018-05-01 00:02:00  0.000969
3 2018-05-01 00:03:00  0.001107
4 2018-05-01 00:04:00  0.000984

Option2:

In [9]:
read_data2 = sql.read_mysql_query("select * from technical_wiki")
read_data2.head()

                 time     value
0 2018-05-01 00:00:00  0.001010
1 2018-05-01 00:01:00  0.000993
2 2018-05-01 00:02:00  0.000969
3 2018-05-01 00:03:00  0.001107
4 2018-05-01 00:04:00  0.000984